tutorials/DLpisoFoam/_2D/inclined_plate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    geometry_inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    geometry_outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    geometry_top
    {
        type            noSlip;
    }
    geometry_obstacle
    {
        type            noSlip;
    }
    up
    {
        type            empty;
    }
}


// ************************************************************************* //
